models/PayType.php

SELECT `title`, `pay_type`.`id` FROM `pay_type`
---
    public static function getPayType(): array
    {
        return static::find()
            ->select('title')
            ->indexBy('id')
            ->column();