models/Status.php

public static function getStatusTitle(int $id): string
{
return static::findOne($id)->title;
---
SELECT * FROM `status` WHERE `id`=1