models/ZalType.php

    public static function getZalType(): array
    {
        return static::find()
            ->select('title')
            ->indexBy('id')
            ->column();
---
SELECT `title`, `zal_type`.`id` FROM `zal_type`